In [52]:
#1. How to make a dataframe using lists

#2. DataFrame functions

In [1]:
import pandas as pd

In [19]:
# crete DataFrame from a multi-dimensional list

fruits=[['apple', 'banana', 'cytrus'],[120, 40, 60]]
pd.DataFrame(fruits)

       0       1       2
0  apple  banana  cytrus
1    120      40      60

In [8]:
pd.DataFrame(fruits).transpose()

        0    1
0   apple  120
1  banana   40
2  cytrus   60

In [12]:
# you can zip 2 lists using .zip()

fruits1=['apple', 'banana', 'cytrus', 'lemon']
price1=[120, 40, 60, 50]

pd.DataFrame(zip(fruits1, price1), columns=['name', 'price'])

     name  price
0   apple    120
1  banana     40
2  cytrus     60
3   lemon     50

In [17]:
#  create a dictionary from 2 lists

fruit3=['apple', 'banana', 'cytrus', 'lemon', 'orange']
price3=[120, 40, 50, 60, 70]

fruits_dict={'name':fruit3, 
             'price': price3}

print(fruits_dict)

{'name': ['apple', 'banana', 'cytrus', 'lemon', 'orange'], 'price': [120, 40, 50, 60, 70]}

In [26]:
# create dataframe from dict

df1= pd.DataFrame(fruits_dict)

In [27]:
df1

     name  price
0   apple    120
1  banana     40
2  cytrus     50
3   lemon     60
4  orange     70

In [24]:
pd.DataFrame.from_dict(fruits_dict)

     name  price
0   apple    120
1  banana     40
2  cytrus     50
3   lemon     60
4  orange     70

In [28]:
# .info() gives me a lot about the dataframe I'm using

# .info() gives 
#Number of rows and its range of index
#Total number of columns
#List of columns
#Count of the total number of non-null values in the column
#Data type of column
#Count of columns in each data type
#Memory usage by the DataFrame

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   price   5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [29]:
df1.describe()

            price
count    5.000000
mean    68.000000
std     31.144823
min     40.000000
25%     50.000000
50%     60.000000
75%     70.000000
max    120.000000

In [30]:
print('DF1 shape: ', df1.shape)

DF1 shape:  (5, 2)

In [31]:
print('DF1 shape[0]: ', df1.shape[0])

DF1 shape[0]:  5

In [32]:
print('DF1 shape[1]: ', df1.shape[1])

DF1 shape[1]:  2

In [33]:
print('DF1 names of columns: ', df1.columns)

DF1 names of columns:  Index(['name', 'price'], dtype='object')

In [34]:
print('DF1 how the dataset is indexed: ', df1.index)

DF1 how the dataset is indexed:  RangeIndex(start=0, stop=5, step=1)

In [39]:
print('DF1 columns data types is: ', df1.dtypes)

DF1 columns data types is:  name     object
price     int64
dtype: object

In [40]:
print('DF1 row names: ', df1.values)

DF1 row names:  [['apple' 120]
 ['banana' 40]
 ['cytrus' 50]
 ['lemon' 60]
 ['orange' 70]]

In [44]:
df1= df1.sort_values(by=['price'])
df1

     name  price
1  banana     40
2  cytrus     50
3   lemon     60
4  orange     70
0   apple    120

In [45]:
# to convert df to dict, use .to_dict()

df1.to_dict()

{'name': {1: 'banana', 2: 'cytrus', 3: 'lemon', 4: 'orange', 0: 'apple'},
 'price': {1: 40, 2: 50, 3: 60, 4: 70, 0: 120}}

In [48]:
student={'name': ['J','A', 'O', 'B', 'A',"J"], 
        'Age': [2,3,4,5, 3, 2],
        'score': [10,20,30,40, 20, 10]}
students= pd.DataFrame(student)
students

  name  Age  score
0    J    2     10
1    A    3     20
2    O    4     30
3    B    5     40
4    A    3     20
5    J    2     10

In [49]:
students= students.drop_duplicates()
students

  name  Age  score
0    J    2     10
1    A    3     20
2    O    4     30
3    B    5     40